In [20]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd
from numpy.random import randn

In [ ]:
d = Series(['a','b',np.nan,'d'])
d

In [ ]:
d.isnull()

In [ ]:
d.dropna() # can remove any null value

In [ ]:
df = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan, np.nan,np.nan]])
df

In [ ]:
clean_df = df.dropna()
clean_df # removes any row with NaN value

In [ ]:
df.dropna(how='all') # drops rows with condition of NaN as all

In [ ]:
npn= np.nan
df2 = DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])
df2

In [ ]:
df2.dropna(thresh = 2) # condition with atleast 2 data points

In [ ]:
df2.fillna(0) #add values for nan

In [ ]:
df2.fillna({0:0,1:1,2:2,3:3}) #for column as key va;ue was added

In [21]:
#index hierarcy
ser1 = Series(randn(6), index = [[1,1,1,2,2,2],['a','b','c','a','b','c']])

In [22]:
ser1 #multiple indexing levels

1  a   -0.975266
   b    1.590651
   c    0.012588
2  a   -0.497826
   b   -0.487717
   c    1.770944
dtype: float64

In [24]:
ser1.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'b'),
            (2, 'c')],
           )

In [27]:
ser1[2] #can call using outter indices

a   -0.497826
b   -0.487717
c    1.770944
dtype: float64

In [28]:
ser1[:,'a'] #here : for outter index level and second condition for inner

1   -0.975266
2   -0.497826
dtype: float64

In [31]:
df = ser1.unstack() #using unstack you can construct a data frame and now outter becomes rows and inners are colns
df

          a         b         c
1 -0.975266  1.590651  0.012588
2 -0.497826 -0.487717  1.770944

In [33]:
df2 = DataFrame(np.arange(16).reshape(4,4), index=[['a','a','b','b'],[1,2,1,2]], 
                columns = [['ny','la','ny','sf'],['cold','hot','hot','cold']])
df2 #multiple index levels

      ny  la  ny   sf
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [34]:
df2.index.names = ['Ind1','Ind2']
df2.columns.names = ['Cities','Temp']
df2

Cities      ny  la  ny   sf
Temp      cold hot hot cold
Ind1 Ind2
a    1       0   1   2    3
     2       4   5   6    7
b    1       8   9  10   11
     2      12  13  14   15

In [35]:
df2.swaplevel('Cities','Temp', axis = 1)

Temp      cold hot     cold
Cities      ny  la  ny   sf
Ind1 Ind2
a    1       0   1   2    3
     2       4   5   6    7
b    1       8   9  10   11
     2      12  13  14   15

In [41]:
df2.sum(level = 'Temp', axis=1)

Temp       cold  hot
Ind1 Ind2
a    1        3    3
     2       11   11
b    1       19   19
     2       27   27